In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

Matplotlib is building the font cache; this may take a moment.

In [2]:
#Creando un tipo de datos Dataframe

data = {
    "Nombre":["Carla", "Sandra", "Julio", "Benito"],
    "Altura": [150,170,145,190],
    "Edad": [24,19,28,30]
}

people = pd.DataFrame(data)
people

   Nombre  Altura  Edad
0   Carla     150    24
1  Sandra     170    19
2   Julio     145    28
3  Benito     190    30

In [4]:
people = pd.DataFrame(data, columns = ["Altura","Edad","Nombre"])
people

   Altura  Edad  Nombre
0     150    24   Carla
1     170    19  Sandra
2     145    28   Julio
3     190    30  Benito

In [5]:
#Mostrar data con una etiquita, forma1
people.Nombre

0     Carla
1    Sandra
2     Julio
3    Benito
Name: Nombre, dtype: object

In [6]:
#Mostrar data con una etiquita, forma2
people["Nombre"]

0     Carla
1    Sandra
2     Julio
3    Benito
Name: Nombre, dtype: object

In [7]:
#Extracción de filas:
#se usa la funcion: .loc para indexación basada en etiquetas
#.iloc para indexación posicional
people.iloc[3]

Altura       190
Edad          30
Nombre    Benito
Name: 3, dtype: object

In [8]:
#Extraer fila usando loc: 
people.loc[3] #extrae la fila con indice 3

Altura       190
Edad          30
Nombre    Benito
Name: 3, dtype: object

In [9]:
#Modificar datos de una columna
people["Edad"]= 2  #modifica a todos los datos de la columa "Edad"
people

   Altura  Edad  Nombre
0     150     2   Carla
1     170     2  Sandra
2     145     2   Julio
3     190     2  Benito

In [11]:
#Modificando un dato especifico
altura = pd.Series([70, 90], index=[0,3]) #los cambios solo afectan al indice 0 y 3
people["Altura"]= altura
people

   Altura  Edad  Nombre
0    70.0     2   Carla
1     NaN     2  Sandra
2     NaN     2   Julio
3    90.0     2  Benito

In [12]:
people.values

array([[70.0, 2, 'Carla'],
       [nan, 2, 'Sandra'],
       [nan, 2, 'Julio'],
       [90.0, 2, 'Benito']], dtype=object)